ns96/STM32DiscVU/Core/Src/VisualizerApp.c
#include "VisualizerApp.h"
#include "SimpleFFT.h"
#include "FSKDecoder.h"
#include "DatabaseManager.h"
#include "heat565.h"
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"
#include "stm32746g_discovery_audio.h"
#include "stm32746g_discovery_sd.h"
#include "cmsis_os.h"
#include <math.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include "fatfs.h" // Required for DCT File Mapping

// --- DCT Mapping Helper State (RAM Based) ---
typedef struct {
    int totalTime;
    char hash[12]; // 10 chars + null + padding
    char fullLine[32]; // Original record (e.g. DCT2A_1_c1176104dd_320_320)
} SideMapEntry;

// SDRAM Layout:
// FB: 0xC0000000 (Layer 1)
// FB: 0xC0100000 (Layer 2)
// WF: 0xC0200000 (Waterfall - 384KB)
// ... Gap ...
// Side A Map: 0xC0300000 (Allocated 1MB)
// Side B Map: 0xC0400000 (Allocated 1MB)
// Audio DB:   0xC0500000 (Allocated remaining)

#define SIDE_MAP_A_ADDR  ((SideMapEntry*)0xC0300000)
#define SIDE_MAP_B_ADDR  ((SideMapEntry*)0xC0400000)
#define MAX_SIDE_MAP_ENTRIES 20000 // Increased from 10k to 20k (320KB usage per side)

static int g_SideACount = 0;
static int g_SideBCount = 0;
static int g_CachedTotalTime = -1;
static char g_CachedHash[16];

// Helper to load a side file into SDRAM (with Binary Cache)
static int LoadSideMap(char side, SideMapEntry* mapAddr) {
    char pathBin[32];
    snprintf(pathBin, sizeof(pathBin), "/side%c.bin", side);
    
    FIL file;
    // 1. Try Binary Map first (Fast)
    if (f_open(&file, pathBin, FA_READ) == FR_OK) {
        uint32_t fsize = f_size(&file);
        if (fsize > 0 && (fsize % sizeof(SideMapEntry)) == 0) {
            printf("[DCT] Loading Binary Side %c map...\r\n", side);
            UINT br;
            if (f_read(&file, mapAddr, fsize, &br) == FR_OK && br == fsize) {
                f_close(&file);
                return br / sizeof(SideMapEntry);
            }
        }
        f_close(&file);
    }

    // 2. Fallback to Text Map (Original Logic)
    char pathTxt[32];
    snprintf(pathTxt, sizeof(pathTxt), "/side%c.txt", side);
    
    // Fallback: Try lowercase if uppercase fails
    if (f_open(&file, pathTxt, FA_READ) != FR_OK) {
        char sideLower = (side >= 'A' && side <= 'Z') ? (side + 32) : side;
        snprintf(pathTxt, sizeof(pathTxt), "/side%c.txt", sideLower);
        if (f_open(&file, pathTxt, FA_READ) != FR_OK) {
            printf("[DCT] Failed to open %s\r\n", pathTxt);
            return 0;
        }
    }
    
    printf("[DCT] Parsing %s into SDRAM...\r\n", pathTxt);
    
    char lineBuf[128];
    int count = 0;
    while (f_gets(lineBuf, sizeof(lineBuf), &file) && count < MAX_SIDE_MAP_ENTRIES) {
        if (strlen(lineBuf) < 20) continue;

        // Manual Tokenize
        char* p = lineBuf;
        int underscores = 0;
        char* hashStart = NULL;
        char* totalStart = NULL;
        
        while (*p) {
            if (*p == '_') {
                underscores++;
                if (underscores == 2) hashStart = p + 1;
                else if (underscores == 4) totalStart = p + 1;
            }
            p++;
        }
        
        if (hashStart && totalStart) {
            char rawLine[32];
            strncpy(rawLine, lineBuf, sizeof(rawLine));
            rawLine[sizeof(rawLine)-1] = 0;
            // Clean newline for rawLine
            char* nl = strpbrk(rawLine, "\r\n");
            if (nl) *nl = 0;

            char* hEnd = hashStart; while (*hEnd != '_' && *hEnd != 0) hEnd++; *hEnd = 0;
            char* tEnd = totalStart; while (*tEnd >= '0' && *tEnd <= '9') tEnd++; *tEnd = 0;
            
            if (strlen(hashStart) <= 10) {
                mapAddr[count].totalTime = atoi(totalStart);
                strncpy(mapAddr[count].hash, hashStart, 11);
                strncpy(mapAddr[count].fullLine, rawLine, 32);
                count++;
            }
        }
    }
    f_close(&file);
    printf("[DCT] Parsed %d entries.\r\n", count);
    
    return count;
}

// Helper to find the "Real" Audio ID and Full Line from SDRAM
static bool GetMappedRecord(char side, int totalTime, char* outHash, char* outFullLine) {
    // 1. Check Cache
    if (totalTime == g_CachedTotalTime && g_CachedHash[0] != 0) {
        strcpy(outHash, g_CachedHash);
        // Cache fullLine as well? For now we just re-search if needed, but it's already in the struct.
    }

    SideMapEntry* map = (side == 'A' || side == 'a') ? SIDE_MAP_A_ADDR : SIDE_MAP_B_ADDR;
    int count = (side == 'A' || side == 'a') ? g_SideACount : g_SideBCount;
    
    if (count == 0) return false;

    int low = 0, high = count - 1;
    while (low <= high) {
        int mid = low + (high - low) / 2;
        if (map[mid].totalTime == totalTime) {
            strcpy(outHash, map[mid].hash);
            if (outFullLine) strcpy(outFullLine, map[mid].fullLine);
            // Update Cache
            g_CachedTotalTime = totalTime;
            strcpy(g_CachedHash, outHash);
            return true;
        }
        if (map[mid].totalTime < totalTime) low = mid + 1;
        else high = mid - 1;
    }
    
    return false;
}

// --- FSK Debug & Config ---
static float g_BaudRates[] = {300.0f, 600.0f, 1100.0f, 1200.0f, 1300.0f};
static int g_BaudIdx = 3; // Default to 1200
static float g_BaudRate = 1200.0f;
static uint32_t g_LastDebugTime = 0;
float g_MaxSignalLevel = 0.0f;

void addFSKChar(char c);
void addFSKDisplayChar(char c);
void addFSKDisplayString(const char* s);

// --- access to the BSP LTDC handle for double-buffering hack ---
extern LTDC_HandleTypeDef hLtdcHandler;
extern DMA2D_HandleTypeDef hdma2d;

// --- DMA2D Helper Prototypes ---
static void FillRectDMA2D(uint32_t* fb, int x, int y, int w, int h, uint32_t color);
static void CopyBlockDMA2D(uint32_t* src, uint32_t* dst, int width, int height);

// --- Global State ---
bool g_ShowSpectrum = true;
bool g_ShowVUMeter = true;
bool g_ShowWaterfall = false;
bool g_SimulationMode = true;
bool g_InputLineIn = false;
bool g_EnablePeakHold = true;
bool g_ShowFSK = false;
int g_SpectrumMode = 0;

