ns96/STM32DiscVU/Core/Src/VisualizerApp.c
// --- Spectrum Colors (Customizable) ---
#define COLOR_SPEC_L  LCD_COLOR_YELLOW
#define COLOR_SPEC_R  LCD_COLOR_RED

// --- UI Layout ---
#define UI_HEADER_H      30
#define UI_VIZ_TOP       30
#define UI_VIZ_BOTTOM    230
#define UI_FOOTER_Y      230

// --- Global System Tuning ---
// Baud Correction: If the measured baud rate is off, adjust this factor.
// Example: If measured baud is 5% high (e.g. 1260 instead of 1200), set this to 1.05f.
// Example: If measured baud is 5% low (e.g. 1140 instead of 1200), set this to 0.95f.
float g_BaudCorrectionFactor = 1.01f; 

// --- Optimization / Sensitivity Settings ---
float g_SpectrumGain = 6.0f;
float g_WaterfallGain = 6.0f; 
float g_MicGain = 24.0f;      // Standard gain for microphones
float g_LineInGain = 0.75f;   // lower default gain for line-in
float g_AudioGain = 24.0f;    // Active gain used in processing
float g_VUGain = 2.0f;
float g_PeakDecay = 10.0f;     // Pixels per frame to fall
float g_VUDecay = 0.80f;      // Exponential fall per frame (0.80-0.90 for fast response)
float g_FSKGain = 10.0f;       // Boost for FSK processing (5.0-10.0 typical)
int g_PeakHoldFrames = 5;    // Frames to hold peak before falling
static float vu_gain_vals[] = {0.5f, 1.0f, 2.0f, 4.0f, 8.0f};
static const char* vu_gain_texts[] = {"x0.5", "x1", "x2", "x4", "x8"};
static int vu_gain_idx = 2; // Default to 2.0
static bool g_GainAlwaysActive = true;

// --- Buffers & Double Buffering State ---
static uint32_t fb_addresses[2] = { LCD_FB_START_ADDRESS, LCD_FB_START_ADDRESS + LCD_FB_OFFSET };
#define WFALL_FB_ADDRESS (LCD_FB_START_ADDRESS + 2 * LCD_FB_OFFSET)
#define WFALL_WIDTH  480
#define WFALL_HEIGHT 200 // UI_FOOTER_Y - UI_HEADER_H
static int g_WfallHead = 0; // Circular buffer head pointer
static int front_buffer_idx = 0;

// --- CPU Load State ---
extern volatile uint32_t g_IdleTicks;
static uint32_t cpu_baseline = 0;
static uint32_t last_idle_val = 0;
static uint32_t last_cpu_tick = 0;
static int current_cpu_load = 0;

// --- Audio / Viz State ---
static float vReal[FFT_SIZE];
static float vImag[FFT_SIZE];
static float vRealFFT[FFT_SIZE];
static float vImagFFT[FFT_SIZE];

// Separate buffers for Stereo Split mode
static float vRealL[FFT_SIZE];
static float vRealR[FFT_SIZE];
static float vRealFFTL[FFT_SIZE];
static float vRealFFTR[FFT_SIZE];

static uint16_t fftIdx = 0;
static float peakL = 0.0f;
static float peakR = 0.0f;
static uint8_t fft_mag_sim[64]; 

// --- Peak Hold State ---
static float g_SpectrumPeaks[128];
static uint8_t g_PeakHoldCount[128];
static float g_VUPeaks[2]; // 0=L, 1=R
static uint8_t g_VUPeakHoldCount[2];

// --- Database & Metadata ---
static AudioInfo g_CurrentTrack;
static bool g_HasMetadata = false;

// --- ISO Standard Frequency Mappings (256 FFT Bins -> Octave Bands) ---

// 31-Band (1/3 Octave) for Stereo Split (31 Left + 31 Right = 62)
static const uint8_t g_ISO31_Map[31][2] = {
    {1,2},   {2,3},   {3,4},   {4,5},   {5,6},   {6,7},   {7,8},   {8,10},
    {10,12}, {12,15}, {15,18}, {18,22}, {22,27}, {27,33}, {33,40}, {40,49}, 
    {49,60}, {60,73}, {73,89}, {89,109},{109,133},{133,163},{163,190},{190,210},
    {210,225},{225,235},{235,245},{245,250},{250,253},{253,254},{254,255}
};

// 62-Band (1/6 Octave) for Mono Mode (Full Display)
static const uint8_t g_ISO62_Map[62][2] = {
    {1,2},   {2,3},   {3,4},   {4,5},   {5,6},   {6,7},   {7,8},   {8,9},   {9,10},  {10,11},
    {11,12}, {12,13}, {13,14}, {14,15}, {15,17}, {17,19}, {19,21}, {21,23}, {23,26}, {26,29},
    {29,32}, {32,35}, {35,39}, {39,43}, {43,47}, {47,52}, {52,57}, {57,63}, {63,69}, {69,76},
    {76,84}, {84,92}, {92,101},{101,111},{111,122},{122,134},{134,147},{147,161},{161,176},{176,193},
    {193,200},{200,205},{205,210},{210,215},{215,220},{220,225},{225,230},{230,234},{234,238},{238,242},
    {242,245},{245,248},{248,251},{251,253},{253,254},{254,255},{255,255},{255,255},{255,255},{255,255},
    {255,255},{255,255}
};

// Helper to convert magnitude to Log-dB Bar Height
static int getLogBarHeight(float* fftData, int barIdx, int maxH, float gain, const uint8_t map[][2], int numBands) {
    if (barIdx < 0 || barIdx >= numBands) return 0;
    int bS = map[barIdx][0];
    int bE = map[barIdx][1];
    
    // Energy Estimation: Use RMS across the band
    float energySum = 0;
    if (bE > bS) {
        for(int b=bS; b<bE; b++) {
            float m = fftData[b];
            energySum += m * m;
        }
        energySum = sqrtf(energySum / (float)(bE - bS));
    } else {
        energySum = fftData[bS];
    }
    
    float val = energySum * gain;
    if (val <= 0.01f) return 0;
    
    // Fast dB-like conversion approximation to avoid log10f
    // log10(x) is roughly proportional to the exponent in float representation
    // Or just use a simple power-law for visual scaling if dB precision isn't critical.
    // For now, let's use a faster log approximation:
    float db;
    if (val < 0.0001f) db = 0;
    else {
        // Simple fast log approximation: 20 * log10(x) = 20 * ln(x) / ln(10) ~= 8.68 * ln(x)
        // Here we can use a simpler power-law for visual: val^0.3 is often enough for "log-like" look
        // but let's stick to a fast log if possible.
        // Actually, log10f is about 150 cycles. 62 bands * 150 = 9300 cycles.
        // Compared to 3x FFTs (150k cycles), it might not be the MAIN bottleneck, but still good to optimize.
        db = 20.0f * log10f(val + 1.0f); 
    }
    
    float maxDb = 48.0f; // Lowered from 85.0 to reach red segments more easily
    float minDb = 12.0f; // Lowered slightly to show more low-level activity
    
    if (db < minDb) return 0;
    if (db > maxDb) db = maxDb;
    
    int h = (int)(((db - minDb) / (maxDb - minDb)) * (float)maxH);
    return h;
}

// --- FSK Decoder State ---
FSK_Modem g_Modem;
static char g_FSKText[2048]; // Large scrollable buffer
static int g_FSKTextLen = 0;

// --- TapeTester Stats (Pure C) ---
typedef struct {
    int logLineCount;
    int dataErrors;
    int dataLengthErrors;
    int numberConversionErrors;
    int invalidCharacterErrors;
    int stopRecords;
    int totalStops;
    int sideAErrors;
    int sideALineCount;
    int sideBErrors;
    int sideBLineCount;
    char currentSide;
    bool isDctMode;
    int lastTotalTime;
} TapeStats;

