ns96/STM32DiscVU/Core/Src/VisualizerApp.c
static TapeStats g_TapeStats = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'A', false};
static char g_CurrentLineBuf[64];
static int g_CurrentLineIdx = 0;

// Offload State for Main Thread
volatile bool g_LineReady = false;
char g_ReadyLineBuf[64];
char g_CurrentMappedRecord[32] = ""; // Fixed header for DCT mapping

static void Tape_ProcessLine(char* line) {
    if (!line || line[0] == 0) return;
    
    // Trim trailing whitespace for robust statistics counting
    int len = strlen(line);
    while (len > 0 && (line[len-1] == ' ' || line[len-1] == '\t' || line[len-1] == '\r' || line[len-1] == '\n')) {
        line[--len] = '\0';
    }
    
    // 1. Carrier Lost Check
    if (strstr(line, "### NOCARRIER") != NULL) {
        if (g_TapeStats.stopRecords == 0) g_TapeStats.totalStops++;
        g_TapeStats.stopRecords++;
        g_HasMetadata = false; // Clear on stop
        g_CurrentMappedRecord[0] = '\0'; // Clear fixed header on stop
        return;
    }

    // 2. Valid Data Record Check (Strictly 29 chars to match generic records)
    if (len == 29 && line[0] != '#') {
        g_TapeStats.logLineCount++;
        if (g_TapeStats.currentSide == 'A') g_TapeStats.sideALineCount++;
        else g_TapeStats.sideBLineCount++;
        g_TapeStats.stopRecords = 0;

        // Split fields (ID_TRACK_HASH_TIME_TOTAL)
        char lineCopy[32];
        strncpy(lineCopy, line, sizeof(lineCopy));
        char* parts[5];
        int pCount = 0;
        char* tok = strtok(lineCopy, "_");
        while(tok && pCount < 5) {
            parts[pCount++] = tok;
            tok = strtok(NULL, "_");
        }

        if (pCount == 5) {
            char* tapeId = parts[0];
            char* hash = parts[2];
            
            // Side Detection
            int idLen = strlen(tapeId);
            if (idLen > 0) {
                char side = tapeId[idLen-1];
                if (side == 'A' || side == 'a') g_TapeStats.currentSide = 'A';
                else if (side == 'B' || side == 'b') g_TapeStats.currentSide = 'B';
            }

            // DCT Auto-Detect Check
            if (strcmp(tapeId, "DCT0A") == 0 || strcmp(tapeId, "DCT0B") == 0) {
                if (!g_TapeStats.isDctMode) {
                     printf("[DCT] Auto-Detected! Mode Enabled.\r\n");
                     g_TapeStats.isDctMode = true;
                }
            } else {
                if (g_TapeStats.isDctMode) {
                     printf("[DCT] Tape Changed. Mode Disabled.\r\n");
                     g_TapeStats.isDctMode = false;
                }
            }

            // Database Lookup (DCT vs Generic)
            char lookupHash[16] = {0};
            bool readyToLookup = false;

            if (g_TapeStats.isDctMode) {
                // DCT Mode: Use Timecode to find Real Hash and Full Line from side file
                int totalTime = atoi(parts[4]);
                g_TapeStats.lastTotalTime = totalTime;
                char mappedFullLine[32] = {0};
                if (GetMappedRecord(g_TapeStats.currentSide, totalTime, lookupHash, mappedFullLine)) {
                    readyToLookup = true;
                    // Update the fixed header instead of interspersing in the log
                    strncpy(g_CurrentMappedRecord, mappedFullLine, sizeof(g_CurrentMappedRecord)-1);
                    g_CurrentMappedRecord[sizeof(g_CurrentMappedRecord)-1] = '\0';
                } else {
                    // Optional: Print only if changed or verbose?
                    // printf("[DCT] No Map for Time: %d\r\n", totalTime);
                }
            } else {
                // Generic Mode: Use the Hash directly from the line
                g_TapeStats.lastTotalTime = atoi(parts[4]);
                if (strlen(hash) == 10) {
                    strncpy(lookupHash, hash, 11);
                    readyToLookup = true;
                }
            }

            if (readyToLookup) {
                static char lastLookupHash[16] = "";
                // Check if the TRACK changed (hash changed) OR if we don't have metadata yet
                if (strcmp(lookupHash, lastLookupHash) != 0 || !g_HasMetadata) {
                    strcpy(lastLookupHash, lookupHash);
                    
                    if (DBM_GetAudioInfo(lookupHash, &g_CurrentTrack)) {
                        g_HasMetadata = true;
                        printf("[DBM] Found: %s\r\n", g_CurrentTrack.sourcePath);
                    } else {
                        g_HasMetadata = false;
                    }
                }
            }
        } else {
            g_TapeStats.dataErrors++;
        }
    } else if (strchr(line, '_') != NULL && strstr(line, "###") == NULL) {
        g_TapeStats.dataLengthErrors++;
        g_TapeStats.dataErrors++;
        if (g_TapeStats.currentSide == 'A') g_TapeStats.sideAErrors++;
        else g_TapeStats.sideBErrors++;
    }
}

void addFSKChar(char c) {
    // Thread Safety: This can be called from Modem Task (background) 
    // and from Main Loop (Tape_ProcessLine injections).
    vTaskSuspendAll();

    // 1. Add to scroll buffer (Simple char array, safe for single-writer/single-reader)
    if (g_FSKTextLen < sizeof(g_FSKText) - 1) {
        g_FSKText[g_FSKTextLen++] = c;
        g_FSKText[g_FSKTextLen] = '\0';
    } else {
        memmove(g_FSKText, g_FSKText + 1, sizeof(g_FSKText) - 1);
        g_FSKText[sizeof(g_FSKText) - 2] = c;
        g_FSKText[sizeof(g_FSKText) - 1] = '\0';
    }

    // 2. Add to line buffer for TapeStats (Only called from Modem task / Main loop)
    if (c == '\n' || c == '\r') {
        if (g_CurrentLineIdx > 0) {
            g_CurrentLineBuf[g_CurrentLineIdx] = '\0';
            
            // Offload: Copy to ready buffer and signal main thread
            // This prevents blocking the modem task with SD Card I/O
            if (!g_LineReady) {
                strncpy(g_ReadyLineBuf, g_CurrentLineBuf, sizeof(g_ReadyLineBuf));
                // Only signal if not a control message (unless we want to log it)
                g_LineReady = true; 
            }
            
