ns96/STM32DiscVU/Core/Src/VisualizerApp.c
            g_CurrentLineIdx = 0;
        }
    } else if (g_CurrentLineIdx < sizeof(g_CurrentLineBuf) - 1) {
        g_CurrentLineBuf[g_CurrentLineIdx++] = c;
    }

    xTaskResumeAll();
}

void addFSKDisplayChar(char c) {
    vTaskSuspendAll();
    // Only update the scroll buffer, NEVER the line buffer used for stats
    if (g_FSKTextLen < sizeof(g_FSKText) - 1) {
        g_FSKText[g_FSKTextLen++] = c;
        g_FSKText[g_FSKTextLen] = '\0';
    } else {
        memmove(g_FSKText, g_FSKText + 1, sizeof(g_FSKText) - 1);
        g_FSKText[sizeof(g_FSKText) - 2] = c;
        g_FSKText[sizeof(g_FSKText) - 1] = '\0';
    }
    xTaskResumeAll();
}

void addFSKDisplayString(const char* s) {
    if (!s) return;
    while (*s) {
        addFSKDisplayChar(*s++);
    }
}


// --- Custom Waterfall Color Scheme (Light Blue -> Brown -> Orange) ---
static uint32_t wfall_lut[256];
static void initWaterfallLUT(void) {
    for (int i = 0; i < 256; i++) {
        // Simple linear interpolation
        // 0: Light Blue (173, 216, 230)
        // 128: Brown (139, 69, 19)
        // 255: Orange (255, 165, 0)
        int r, g, b;
        if (i < 128) {
            // 0: Deep Blue (0, 80, 255) - Reduced green for "more blue" look
            // 128: Rich Brown (139, 69, 19)
            float f = i / 128.0f;
            r = (int)(0   * (1.0f - f) + 139 * f);
            g = (int)(80  * (1.0f - f) + 69  * f);
            b = (int)(255 * (1.0f - f) + 19  * f);
        } else {
            // 128: Brown (139, 69, 19)
            // 255: Orange (255, 140, 0)
            float f = (i - 128) / 127.0f;
            r = (int)(139 * (1.0f - f) + 255 * f);
            g = (int)(69  * (1.0f - f) + 140 * f);
            b = (int)(19  * (1.0f - f) + 0   * f);
        }
        wfall_lut[i] = 0xFF000000 | (r << 16) | (g << 8) | b;
    }
}

// --- UI State ---
#define MAX_BUTTONS 7
static Button buttons[MAX_BUTTONS];
static int buttonCount = 0;
static bool ts_enabled = false;

// --- Prototypes ---
static void drawSpectrum(void);
static void drawVU(void);
static void drawWaterfall(void);
static void cycleBaudRate(void);
static void initButtons(void);
static void handleTouch(void);
static void toggleSpectrum(void);
static void toggleWaterfall(void);
static void toggleVU(void);
static void toggleSim(void);
static void toggleInput(void);
static void cycleVUGain(void);
static void toggleFSK(void);
static void drawFSKText(void);
static void Visualizer_InitAudio(void);
static uint32_t Color565ToARGB(uint16_t rgb565);
static void FillRectDMA2D(uint32_t* fb, int x, int y, int w, int h, uint32_t color);

// --- Initialization ---
void Visualizer_Init(void) {
    uint8_t status;
    
    printf("Visualizer_Init: Starting LCD/TS Init...\r\n");
    status = BSP_LCD_Init();
    if (status != LCD_OK) printf("BSP_LCD_Init FAILED\r\n");

    BSP_LCD_LayerDefaultInit(0, LCD_FB_START_ADDRESS);

    BSP_LCD_SelectLayer(0);
    BSP_LCD_DisplayOn();
    BSP_LCD_Clear(LCD_COLOR_BLACK);
    
    // Initialize FFT LUTs
    SimpleFFT_Init();
    
    status = BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
    ts_enabled = (status == TS_OK);
    
    // FSK Decoder initialization moved to StartModemTask in main.c
    printf("VisualizerApp: FSK Decoder ready (background task)...\r\n");
    
    printf("VisualizerApp: Clearing Waterfall Buffer in SDRAM...\r\n");
    initWaterfallLUT(); // CRITICAL: Restore LUT initialization
    uint32_t bgColor = wfall_lut[0];
    uint32_t* ptr = (uint32_t*)WFALL_FB_ADDRESS;
    for(int i=0; i<WFALL_WIDTH * WFALL_HEIGHT; i++) ptr[i] = bgColor;
    // Commit to SDRAM so DMA2D doesn't see garbage on first scroll
    SCB_CleanDCache_by_Addr((uint32_t*)WFALL_FB_ADDRESS, WFALL_WIDTH * WFALL_HEIGHT * 4);

    // Calibrate CPU baseline (idle ticks over 100ms)
    printf("VisualizerApp: Calibrating CPU...\r\n");
    g_IdleTicks = 0;
    osDelay(100); // Use osDelay to yield to Idle task
    cpu_baseline = g_IdleTicks;
    if (cpu_baseline == 0) cpu_baseline = 1; // Prevent div by zero
    last_idle_val = g_IdleTicks;
    last_cpu_tick = HAL_GetTick();
    
    printf("VisualizerApp: initButtons...\r\n");
    initButtons();
    
    printf("VisualizerApp: Visualizer_InitAudio...\r\n");
    Visualizer_InitAudio();

    printf("VisualizerApp: Checking SD Card status...\r\n");
    
    // Set Font and Background for loading messages
    BSP_LCD_SetFont(&Font20);
    BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
    BSP_LCD_SetBackColor(LCD_COLOR_BLACK);

    if (BSP_SD_IsDetected() == SD_PRESENT) {
        printf("VisualizerApp: SD Card DETECTED. Proceeding with DB Init.\r\n");
        
        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_FillRect(0, 120, 480, Font20.Height);
        BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
        BSP_LCD_DisplayStringAt(0, 120, (uint8_t*)"Loading AUDIODB...", CENTER_MODE);
        printf("VisualizerApp: DBM_Init (SDRAM @ 0xC0500000)...\r\n");
        // Use Uppercase for 8.3 compatibility as LFN is disabled in ffconf.h
        if (!DBM_Init("/AUDIODB.TXT", 0xC0500000)) {
            printf("VisualizerApp: DBM_Init FAILED!\r\n");
            BSP_LCD_SetTextColor(LCD_COLOR_RED);
            BSP_LCD_DisplayStringAt(0, 150, (uint8_t*)"DB Load Failed!", CENTER_MODE);
        }

        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_FillRect(0, 120, 480, Font20.Height);
        BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
        BSP_LCD_DisplayStringAt(0, 120, (uint8_t*)"Loading Side Maps...", CENTER_MODE);
        printf("VisualizerApp: Loading Side Maps (RAM)...\r\n");
        g_SideACount = LoadSideMap('A', SIDE_MAP_A_ADDR);
        g_SideBCount = LoadSideMap('B', SIDE_MAP_B_ADDR);
        
    } else {
        printf("VisualizerApp: SD Card NOT DETECTED! Skipping Database Load.\r\n");
        printf("VisualizerApp: System will run in Visualizer-Only mode.\r\n");
        
        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_FillRect(0, 120, 480, Font20.Height);
        BSP_LCD_SetTextColor(LCD_COLOR_RED);
        BSP_LCD_DisplayStringAt(0, 120, (uint8_t*)"SD Card NOT DETECTED!", CENTER_MODE);
        
        g_SideACount = 0;
        g_SideBCount = 0;
        // DBM is static/global, so it naturally stays uninitialized (empty index)
    }

