ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    // Final Cleanup: Clear screen one more time to Layer 0 before visualizer loop starts
    // This ensures no artifacts like "LLoading" remain.
    BSP_LCD_Clear(LCD_COLOR_BLACK);
    
    printf("VisualizerApp: Init sequence complete.\r\n");
}

void Visualizer_ProcessAudio(int16_t* inBuf, uint32_t samples) {
    if (g_SimulationMode) return;

    SCB_InvalidateDCache_by_Addr((uint32_t*)inBuf, samples * 2);

// 1. FSK Processing moved to StartModemTask in main.c

    // Debug Print every 1s (approx)
    if (HAL_GetTick() - g_LastDebugTime > 1000) {
        g_LastDebugTime = HAL_GetTick();
        // FSK DIAGNOSTICS (moved from interrupt context)
        if (g_ShowFSK) {
            // Get raw filter magnitudes for analysis
            float mMag = Filter_GetMag(&g_Modem.filterMark);
            float sMag = Filter_GetMag(&g_Modem.filterSpace);
            
            // Use integer scaling (x100) to avoid float-printf issues on STM32
            printf("[FSK DIAG] Baud:%d | Signal:%d%% | M:%d S:%d | SNR:%d | Carr:%d\r\n", 
                   (int)g_Modem.cfg.baudRate, 
                   (int)(g_MaxSignalLevel * 100.0f), 
                   (int)(mMag * 100.0f), (int)(sMag * 100.0f),
                   (int)(g_Modem.lastSNR * 100.0f), 
                   g_Modem.carrier);
        }
        g_MaxSignalLevel = 0.0f; // Reset peak hold
    }

    // 2. Full-Sample VU Energy Detection (Raw 48kHz RMS Scan)
    // This provides a stable power measurement for FSK sine waves.
    float sumSqL = 0, sumSqR = 0;
    for (uint32_t i = 0; i < samples; i += 2) {
        float sL = (float)inBuf[i] / 32768.0f;
        float sR = (float)inBuf[i + 1] / 32768.0f;
        sumSqL += sL * sL;
        sumSqR += sR * sR;
    }
    
    // Instant Attack for RMS (with gain alignment)
    float instantRmsL = sqrtf(sumSqL / (samples / 2)) * g_AudioGain;
    float instantRmsR = sqrtf(sumSqR / (samples / 2)) * g_AudioGain;
    
    if (instantRmsL > peakL) peakL = instantRmsL;
    if (instantRmsR > peakR) peakR = instantRmsR;

    // 3. Process decimated stream for FFT
    for (uint32_t i = 0; i < samples; i += 2 * RX_DECIMATION) {
        int32_t sumL = 0, sumR = 0;
        for (int j = 0; j < RX_DECIMATION; j++) {
            sumL += inBuf[i + j * 2];
            sumR += inBuf[i + j * 2 + 1];
        }
        
        float rawL = (float)(sumL / RX_DECIMATION) / 32768.0f;
        float rawR = (float)(sumR / RX_DECIMATION) / 32768.0f;
        float mono = (rawL + rawR) * 0.5f;
        
        static float dc_offset = 0.0f;
        dc_offset = 0.999f * dc_offset + 0.001f * mono;
        float clean = (mono - dc_offset) * g_AudioGain;
        
        if (fftIdx < FFT_SIZE) {
            vReal[fftIdx] = clean;
            vImag[fftIdx] = 0.0f;
            vRealL[fftIdx] = rawL * g_AudioGain;
            vRealR[fftIdx] = rawR * g_AudioGain;
            fftIdx++;
        }
    }
}

void Visualizer_Update(void) {
    handleTouch();
    
    int back_idx = 1 - front_buffer_idx;
    uint32_t back_addr = fb_addresses[back_idx];
    uint32_t* back_fb = (uint32_t*)back_addr;

    // --- Prepare Hidden Buffer for Drawing ---
    // We ONLY update the internal pointers here. 
    // DO NOT trigger a hardware reload yet! This fixes the flickering.
    hLtdcHandler.LayerCfg[0].FBStartAdress = back_addr; 
    
    // Invalidate D-Cache for the HUD and Viz area only
    SCB_InvalidateDCache_by_Addr((uint32_t*)back_addr, 480 * UI_VIZ_BOTTOM * 4);

    // Targeted Screen Clear (DMA2D) - Full Height (272)
    // We restore full clear to ensure double-buffer consistency until partial updates are perfect.
    FillRectDMA2D(back_fb, 0, 0, 480, 272, LCD_COLOR_BLACK);

    if (g_SimulationMode) {
        static float simP = 0.0f; simP += 0.04f; // Slower simulation for smoother look
        peakL = (sinf(simP) + 1.0f) * 0.5f; peakR = (cosf(simP * 1.3f) + 1.0f) * 0.5f;
        for(int i=0; i<64; i++) fft_mag_sim[i] = (uint8_t)((sinf(simP + i*0.2f) + 1.0f) * 127.0f);
    } else if (fftIdx >= FFT_SIZE) {
        // 1. Process FFT with 50% overlap (every 256 samples)
        if (g_SpectrumMode == 1 || g_SpectrumMode == 3) {
            // Compute Left FFT
            memcpy(vRealFFT, vRealL, sizeof(vRealFFT)); 
            memset(vImagFFT, 0, sizeof(vImagFFT));
            SimpleFFT_Windowing_Fast(vRealFFT, FFT_SIZE);
            SimpleFFT_Compute(vRealFFT, vImagFFT, FFT_SIZE);
            SimpleFFT_ComplexToMagnitude(vRealFFT, vImagFFT, FFT_SIZE);
            memcpy(vRealFFTL, vRealFFT, sizeof(vRealFFTL));

            // Compute Right FFT
            memcpy(vRealFFT, vRealR, sizeof(vRealFFT)); 
            memset(vImagFFT, 0, sizeof(vImagFFT));
            SimpleFFT_Windowing_Fast(vRealFFT, FFT_SIZE);
            SimpleFFT_Compute(vRealFFT, vImagFFT, FFT_SIZE);
            SimpleFFT_ComplexToMagnitude(vRealFFT, vImagFFT, FFT_SIZE);
            memcpy(vRealFFTR, vRealFFT, sizeof(vRealFFTR));
            
            // OPTIMIZATION: Synthesize Mono for Waterfall from L/R to avoid 3rd FFT
            if (g_ShowWaterfall) {
                for(int i=0; i<FFT_SIZE/2; i++) {
                    vRealFFT[i] = (vRealFFTL[i] + vRealFFTR[i]) * 0.5f;
                }
            }
        } else {
            // Standard Mono FFT
            memcpy(vRealFFT, vReal, sizeof(vRealFFT)); 
            memset(vImagFFT, 0, sizeof(vImagFFT));
            SimpleFFT_Windowing_Fast(vRealFFT, FFT_SIZE);
            SimpleFFT_Compute(vRealFFT, vImagFFT, FFT_SIZE);
            SimpleFFT_ComplexToMagnitude(vRealFFT, vImagFFT, FFT_SIZE);
        }
        
        // --- 50% Overlap Buffer Shift ---
        int shift = 256;
        memmove(vReal, vReal + shift, (FFT_SIZE - shift) * sizeof(float));
        memmove(vRealL, vRealL + shift, (FFT_SIZE - shift) * sizeof(float));
        memmove(vRealR, vRealR + shift, (FFT_SIZE - shift) * sizeof(float));
        fftIdx = 256;
    }

    // Decay: Smoothly drop meters in UI loop
    peakL *= g_VUDecay;
    peakR *= g_VUDecay;
    
    // Global Spectrum Peak Decay
    int totalPeaks = 62; // Always 62 bands in both Mono and Split
    for(int i=0; i<totalPeaks; i++) {
        if (g_PeakHoldCount[i] > 0) g_PeakHoldCount[i]--;
        else if (g_SpectrumPeaks[i] > 0) g_SpectrumPeaks[i] -= g_PeakDecay;
    }

    // VU Peak Decay
    for(int i=0; i<2; i++) {
        if (g_VUPeakHoldCount[i] > 0) g_VUPeakHoldCount[i]--;
        else if (g_VUPeaks[i] > 0) g_VUPeaks[i] -= (g_PeakDecay * 2.0f); // Fast horizontal fall
    }

