ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    // 2. Draw Visualizations (Background layer)
    if (g_ShowWaterfall) drawWaterfall();
    else if (g_ShowSpectrum) drawSpectrum();
    
    if (g_ShowFSK) drawFSKText();

    // Calculate CPU Load every 500ms
    uint32_t now = HAL_GetTick();
    if (now - last_cpu_tick >= 500) {
        uint32_t diff = g_IdleTicks - last_idle_val;
        float expected = (float)cpu_baseline * (float)(now - last_cpu_tick) / 100.0f;
        if (expected > 0) {
            float load = 100.0f * (1.0f - (float)diff / expected);
            if (load < 0) load = 0;
            if (load > 100) load = 100;
            current_cpu_load = (int)load;
        }
        last_idle_val = g_IdleTicks;
        last_cpu_tick = now;
    }

    // 3. Draw HUD elements (Header) - ALWAYS draw to avoid flicker in double buffer
    BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    FillRectDMA2D(back_fb, 0, 0, 480, UI_HEADER_H, LCD_COLOR_BLUE);
    while (hdma2d.Instance->CR & DMA2D_CR_START);

    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
    BSP_LCD_SetFont(&Font16);
    char buf[64]; 
    int freq_khz = SAMPLING_FREQ / 1000;
    
    // Calculate FPS
    static uint32_t frame_count = 0;
    static uint32_t last_fps_time = 0;
    static int current_fps = 0;
    
    frame_count++;
    if (HAL_GetTick() - last_fps_time >= 1000) {
        current_fps = frame_count;
        frame_count = 0;
        last_fps_time = HAL_GetTick();
        printf("[SYS] FPS:%d | CPU:%d%%\r\n", current_fps, current_cpu_load);
        
        // FSK DIAGNOSTICS
        if (g_ShowFSK) {
            float mMag = Filter_GetMag(&g_Modem.filterMark);
            float sMag = Filter_GetMag(&g_Modem.filterSpace);
            printf("[FSK DIAG] Baud:%d | Sig:%d%% | M:%d S:%d | SNR:%f | Carr:%d\r\n", 
                   (int)g_Modem.cfg.baudRate, 
                   (int)(g_MaxSignalLevel * 100.0f), 
                   (int)(mMag * 100.0f), (int)(sMag * 100.0f),
                   g_Modem.lastSNR, 
                   g_Modem.carrier);
             g_MaxSignalLevel = 0.0f; // Reset peak hold
        }
    }

    float dispL = (peakL / g_AudioGain) * 100.0f;
    float dispR = (peakR / g_AudioGain) * 100.0f;
    if (dispL > 100.0f) dispL = 100.0f;
    if (dispR > 100.0f) dispR = 100.0f;

    snprintf(buf, sizeof(buf), "DiscVU %dkHz / L:%03d%% R:%03d%% CPU:%d%% FPS:%d", 
             freq_khz, (int)dispL, (int)dispR, current_cpu_load, current_fps);
    BSP_LCD_DisplayStringAt(10, 7, (uint8_t*)buf, LEFT_MODE);

    // Final safety wait: ensure all DMA2D operations completed before returning
    while (hdma2d.Instance->CR & DMA2D_CR_START);
    
    // 4. Draw VU Meter (Overlay at top-ish)
    if (g_ShowVUMeter) drawVU();

    // 5. Draw Buttons (Overlay at bottom)
    for(int i=0; i<buttonCount; i++) {
        Button* b = &buttons[i];
        uint32_t color = *b->toggleMode ? b->color : LCD_COLOR_DARKGRAY;
        FillRectDMA2D(back_fb, b->x, b->y, b->w, b->h, color);
        BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
        BSP_LCD_SetBackColor(color);
        BSP_LCD_SetFont(&Font12);
        BSP_LCD_DisplayStringAt(b->x + 5, b->y + 10, (uint8_t*)b->text, LEFT_MODE);
    }

    // 6. Commit Frame (VSync-Locked Flip)
    SCB_CleanDCache_by_Addr((uint32_t*)back_addr, 480 * 272 * 4);
    
    // Ensure all DMA2D operations are finished
    while (hdma2d.Instance->CR & DMA2D_CR_START);
    
    // 6. Handle Background Tasks (Main Thread Context)
    // Check for FSK lines offloaded from Modem Task
    if (g_LineReady) {
        Tape_ProcessLine(g_ReadyLineBuf);
        g_LineReady = false;
    }

    // 7. Flip Buffers (Hardware VSync)

    // Update hardware address and request Vertical Blanking Reload
    // Use NoReload variant to ensure Atomic switch at VSync
    HAL_LTDC_SetAddress_NoReload(&hLtdcHandler, back_addr, 0);
    HAL_LTDC_Reload(&hLtdcHandler, LTDC_SRCR_VBR); 
    
    // IMPORTANT: Wait for hardware to acknowledge the flip.
    // This prevents racing the scanline and eliminates all flickering.
    uint32_t reload_start = HAL_GetTick();
    while ((hLtdcHandler.Instance->SRCR & LTDC_SRCR_VBR) && (HAL_GetTick() - reload_start < 20)); 

    front_buffer_idx = back_idx;
}


static void drawSpectrum() {
    int bottomY = UI_VIZ_BOTTOM; int maxH = UI_VIZ_BOTTOM - UI_VIZ_TOP;
    uint32_t* back_fb = (uint32_t*)hLtdcHandler.LayerCfg[0].FBStartAdress;
    
    if (g_SpectrumMode == 1) {
        // --- 31/31 ISO Standard Stereo Split ---
        int barW = 7; 
        int totalW = 31 * barW;
        int leftX = (240 - totalW) / 2;
        int rightX = 240 + (240 - totalW) / 2;

        // Draw Divider
        for(int i=UI_VIZ_TOP; i<UI_VIZ_BOTTOM; i++) back_fb[i*480 + 240] = 0xFF555555;

        for(int i=0; i<31; i++) {
            // LEFT CHANNEL
            int hL = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFTL, i, maxH, g_SpectrumGain, g_ISO31_Map, 31);
            
            if (g_EnablePeakHold) {
                if ((float)hL >= g_SpectrumPeaks[i]) { g_SpectrumPeaks[i] = (float)hL; g_PeakHoldCount[i] = g_PeakHoldFrames; }
            }
            FillRectDMA2D(back_fb, leftX + i*barW, bottomY - hL, barW-1, hL, COLOR_SPEC_L);
            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[i];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (leftX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = COLOR_SPEC_L;
                }
            }

            // RIGHT CHANNEL
            int hR = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFTR, i, maxH, g_SpectrumGain, g_ISO31_Map, 31);
            int rIdx = 31 + i;
            if (g_EnablePeakHold) {
                if ((float)hR >= g_SpectrumPeaks[rIdx]) { g_SpectrumPeaks[rIdx] = (float)hR; g_PeakHoldCount[rIdx] = g_PeakHoldFrames; }
            }
            FillRectDMA2D(back_fb, rightX + i*barW, bottomY - hR, barW-1, hR, COLOR_SPEC_R);
             if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[rIdx];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (rightX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = COLOR_SPEC_R;
                }
            }
        }
    } else if (g_SpectrumMode == 2) {
        // --- 62-Band LED Mono Mode ---
        int barW = 7; 
        int totalW = 62 * barW;
        int startX = (480 - totalW) / 2;
        int segH = 4;
        int gap = 1;
        int totalSegH = segH + gap;
        
