ns96/STM32DiscVU/Core/Src/VisualizerApp.c
        for(int i=0; i<62; i++) {
            int h = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFT, i, maxH, g_SpectrumGain, g_ISO62_Map, 62);
            
            if (g_EnablePeakHold) {
                if ((float)h >= g_SpectrumPeaks[i]) { g_SpectrumPeaks[i] = (float)h; g_PeakHoldCount[i] = g_PeakHoldFrames; }
            }

            // Draw LED Segments
            int numSegs = h / totalSegH;
            for (int s = 0; s < numSegs; s++) {
                uint32_t segColor;
                float percent = (float)(s * totalSegH) / (float)maxH;
                if (percent < 0.6f) segColor = LCD_COLOR_GREEN;
                else if (percent < 0.85f) segColor = LCD_COLOR_YELLOW;
                else segColor = LCD_COLOR_RED;
                
                FillRectDMA2D(back_fb, startX + i*barW, bottomY - (s+1)*totalSegH + gap, barW-1, segH, segColor);
            }

            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[i];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                // Peak dot color matches the segment level
                uint32_t peakColor;
                float pPercent = (float)(g_SpectrumPeaks[i]) / (float)maxH;
                if (pPercent < 0.6f) peakColor = LCD_COLOR_GREEN;
                else if (pPercent < 0.85f) peakColor = LCD_COLOR_YELLOW;
                else peakColor = LCD_COLOR_RED;

                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (startX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = peakColor;
                }
            }
        }
    } else if (g_SpectrumMode == 3) {
        // --- 31/31 ISO Standard Stereo Split LED Mode ---
        int barW = 7; 
        int totalW = 31 * barW;
        int leftX = (240 - totalW) / 2;
        int rightX = 240 + (240 - totalW) / 2;
        int segH = 4;
        int gap = 1;
        int totalSegH = segH + gap;

        // Draw Divider
        for(int i=UI_VIZ_TOP; i<UI_VIZ_BOTTOM; i++) back_fb[i*480 + 240] = 0xFF555555;

        for(int i=0; i<31; i++) {
            // LEFT CHANNEL LED
            int hL = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFTL, i, maxH, g_SpectrumGain, g_ISO31_Map, 31);
            if (g_EnablePeakHold) {
                if ((float)hL >= g_SpectrumPeaks[i]) { g_SpectrumPeaks[i] = (float)hL; g_PeakHoldCount[i] = g_PeakHoldFrames; }
            }
            int numSegsL = hL / totalSegH;
            for (int s = 0; s < numSegsL; s++) {
                uint32_t segColor;
                float percent = (float)(s * totalSegH) / (float)maxH;
                if (percent < 0.6f) segColor = LCD_COLOR_GREEN;
                else if (percent < 0.85f) segColor = LCD_COLOR_YELLOW;
                else segColor = LCD_COLOR_RED;
                FillRectDMA2D(back_fb, leftX + i*barW, bottomY - (s+1)*totalSegH + gap, barW-1, segH, segColor);
            }
            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[i];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                uint32_t peakColor;
                float pPercent = (float)(g_SpectrumPeaks[i]) / (float)maxH;
                if (pPercent < 0.6f) peakColor = LCD_COLOR_GREEN;
                else if (pPercent < 0.85f) peakColor = LCD_COLOR_YELLOW;
                else peakColor = LCD_COLOR_RED;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (leftX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = peakColor;
                }
            }

            // RIGHT CHANNEL LED
            int hR = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFTR, i, maxH, g_SpectrumGain, g_ISO31_Map, 31);
            int rIdx = 31 + i;
            if (g_EnablePeakHold) {
                if ((float)hR >= g_SpectrumPeaks[rIdx]) { g_SpectrumPeaks[rIdx] = (float)hR; g_PeakHoldCount[rIdx] = g_PeakHoldFrames; }
            }
            int numSegsR = hR / totalSegH;
            for (int s = 0; s < numSegsR; s++) {
                uint32_t segColor;
                float percent = (float)(s * totalSegH) / (float)maxH;
                if (percent < 0.6f) segColor = LCD_COLOR_GREEN;
                else if (percent < 0.85f) segColor = LCD_COLOR_YELLOW;
                else segColor = LCD_COLOR_RED;
                FillRectDMA2D(back_fb, rightX + i*barW, bottomY - (s+1)*totalSegH + gap, barW-1, segH, segColor);
            }
            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[rIdx];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                uint32_t peakColor;
                float pPercent = (float)(g_SpectrumPeaks[rIdx]) / (float)maxH;
                if (pPercent < 0.6f) peakColor = LCD_COLOR_GREEN;
                else if (pPercent < 0.85f) peakColor = LCD_COLOR_YELLOW;
                else peakColor = LCD_COLOR_RED;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (rightX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = peakColor;
                }
            }
        }
    } else {
        // --- 62-Band ISO Standard Mono Mode ---
        int barW = 7; 
        int totalW = 62 * barW;
        int startX = (480 - totalW) / 2;
        
        for(int i=0; i<62; i++) {
            int h = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFT, i, maxH, g_SpectrumGain, g_ISO62_Map, 62);
            
            if (g_EnablePeakHold) {
                if ((float)h >= g_SpectrumPeaks[i]) { g_SpectrumPeaks[i] = (float)h; g_PeakHoldCount[i] = g_PeakHoldFrames; }
            }

            uint32_t barColor = Color565ToARGB(heat565[i*4%256]);
            FillRectDMA2D(back_fb, startX + i*barW, bottomY - h, barW-1, h, barColor);
            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[i];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (startX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = barColor;
                }
            }
        }
    }
}

static void drawWaterfall() {
    int topY = UI_VIZ_TOP;
    int height = UI_VIZ_BOTTOM - UI_VIZ_TOP; // Exactly 200
    int width = WFALL_WIDTH; // 480
    uint32_t* wfall_fb = (uint32_t*)WFALL_FB_ADDRESS;

    // 1. Advance Circular Head
    g_WfallHead--;
    if (g_WfallHead < 0) g_WfallHead = height - 1;
    
