ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    uint32_t* newRow = &wfall_fb[g_WfallHead * width];

    // 2. Fill new row with FFT data
    if (g_SimulationMode) {
        for(int x=0; x<width; x++) {
            int bin = (x * 64) / width;
            newRow[x] = wfall_lut[fft_mag_sim[bin % 64]];
        }
    } else {
        float aMax = 0.5f;
        for(int i=2; i<FFT_SIZE/2; i++) if(vRealFFT[i] > aMax) aMax = vRealFFT[i];

        for(int x=0; x<width; x++) {
            int bin = (x * (FFT_SIZE/2)) / width;
            if (bin < 2) bin = 2;
            float mag = vRealFFT[bin];
            int cIdx = (int)((mag * g_WaterfallGain / aMax) * 255.0f);
            if(cIdx > 255) cIdx = 255;
            newRow[x] = wfall_lut[cIdx];
        }
    }

    // Clean ONLY the new row in D-Cache
    SCB_CleanDCache_by_Addr((uint32_t*)newRow, width * 4);

    // 3. Draw Circular Buffer to Screen using DMA2D (Two chunks)
    uint32_t back_fb_addr = hLtdcHandler.LayerCfg[0].FBStartAdress;
    uint32_t* screen_ptr = (uint32_t*)(back_fb_addr + topY * 480 * 4);
    
    // Part A: From Head to Bottom of buffer
    int rowsA = height - g_WfallHead;
    CopyBlockDMA2D(&wfall_fb[g_WfallHead * width], screen_ptr, width, rowsA);
    
    // Part B: Wrap around from top of buffer to (Head - 1)
    if (g_WfallHead > 0) {
        int rowsB = g_WfallHead;
        CopyBlockDMA2D(wfall_fb, &screen_ptr[rowsA * width], width, rowsB);
    }
}

static void drawVU() {
    int w = 400; int h = 12; int x = 40;
    int yL = UI_HEADER_H + 5; int yR = UI_HEADER_H + 20;

    // Logarithmic (dB) Scaling for "Sensitive" Meters
    // Range: -70dB to +3dB (Headroom for FSK pinning)
    // Using log10f(rms + offset) for stability. 0dB = 1.0f (Target)
    float dbL = 20.0f * log10f((peakL * g_VUGain) / g_AudioGain + 0.000001f);
    float dbR = 20.0f * log10f((peakR * g_VUGain) / g_AudioGain + 0.000001f);
    
    // Calibration: map -60dB -> 0%, 0dB -> 90%, +6dB -> 100%
    // This ensures headroom and prevents pinning.
    const float minDb = -60.0f;
    const float maxDb = 6.0f;
    
    float normL = (dbL - minDb) / (maxDb - minDb);
    if (normL < 0) normL = 0.0f; 
    if (normL > 1.0f) normL = 1.0f;
    float normR = (dbR - minDb) / (maxDb - minDb);
    if (normR < 0) normR = 0.0f; 
    if (normR > 1.0f) normR = 1.0f;

    int lL = (int)(normL * w);
    int rL = (int)(normR * w);
    
    uint32_t* back_fb = (uint32_t*)hLtdcHandler.LayerCfg[0].FBStartAdress;

    if (g_EnablePeakHold) {
        // Attack Logic: Keep instant response in draw loop
        if ((float)lL >= g_VUPeaks[0]) {
            g_VUPeaks[0] = (float)lL;
            g_VUPeakHoldCount[0] = g_PeakHoldFrames; 
        }
        
        if ((float)rL >= g_VUPeaks[1]) {
            g_VUPeaks[1] = (float)rL;
            g_VUPeakHoldCount[1] = g_PeakHoldFrames;
        }
    }

    // Draw L Channel (Green)
    if(lL > 0) FillRectDMA2D(back_fb, x, yL, lL, h, LCD_COLOR_GREEN);
    // Draw L Peak (Green, 4px wide, CPU)
    if(g_EnablePeakHold && g_VUPeaks[0] > 0) {
        int pxBase = x + (int)g_VUPeaks[0];
        for(int py=0; py<h; py++) {
            uint32_t* row = &back_fb[(yL + py) * 480 + pxBase];
            for(int px=0; px<4; px++) row[px] = LCD_COLOR_GREEN;
        }
    }

    // Draw R Channel (Red)
    if(rL > 0) FillRectDMA2D(back_fb, x, yR, rL, h, LCD_COLOR_RED);
    // Draw R Peak (Red, 4px wide, CPU)
    if(g_EnablePeakHold && g_VUPeaks[1] > 0) {
        int pxBase = x + (int)g_VUPeaks[1];
        for(int py=0; py<h; py++) {
            uint32_t* row = &back_fb[(yR + py) * 480 + pxBase];
            for(int px=0; px<4; px++) row[px] = LCD_COLOR_RED;
        }
    }
}

static void drawFSKText(void) {
    BSP_LCD_SetTextColor(LCD_COLOR_DARKGREEN);
    BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
    BSP_LCD_SetFont(&Font12);
    // WAIT for any previous DMA2D operations to finish before CPU writes text
    while (hdma2d.Instance->CR & DMA2D_CR_START);

    BSP_LCD_SetTextColor(LCD_COLOR_GREEN); // Use bright green for high visibility
    BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
    BSP_LCD_SetFont(&Font12);
    
    int startY = UI_VIZ_TOP + 40;
    int endY = UI_VIZ_BOTTOM;
    int lineHeight = 12;
    
    // Split screen logic: FSK Log on left (0-240), Stats on right (240-480)
    int splitX = 240;
    int wrapCount = 34; // Adjusted for Font12 (7px wide, 240/7 = 34)

    // Draw Vertical Separator
    uint32_t* back_fb = (uint32_t*)hLtdcHandler.LayerCfg[0].FBStartAdress;
    for(int i=startY; i<endY; i++) back_fb[i*480 + splitX] = 0xFF555555;

    // --- Left Side: FSK Log ---
    static int logicalLineStarts[128]; // Stack safety (static)
    int logicalLineCount = 0;
    int currentLineLen = 0;

    vTaskSuspendAll();
    int textLen = g_FSKTextLen;
    // Snapshot the text for rendering so we can release the scheduler early
    static char textSnap[2048];
    memcpy(textSnap, g_FSKText, textLen);
    xTaskResumeAll();

    logicalLineStarts[0] = 0;
    logicalLineCount = 1;

    for (int i = 0; i < textLen; i++) {
        char c = textSnap[i];
        currentLineLen++;
        if (c == '\n' || currentLineLen >= wrapCount) {
            if (logicalLineCount < 128) logicalLineStarts[logicalLineCount++] = i + 1;
            currentLineLen = 0;
        }
    }
    if (logicalLineCount > 0 && logicalLineStarts[logicalLineCount-1] >= textLen && textLen > 0) logicalLineCount--;

    int y = startY;
    BSP_LCD_SetFont(&Font12);
    
    // 1. Draw Static Header (Current Mapped Track)
    if (g_CurrentMappedRecord[0] != '\0') {
        BSP_LCD_SetTextColor(LCD_COLOR_YELLOW); // Highlights the mapped record
        BSP_LCD_DisplayStringAt(10, y, (uint8_t*)g_CurrentMappedRecord, LEFT_MODE);
        y += lineHeight;
        // Draw a small separator line
        FillRectDMA2D(back_fb, 10, y + 2, splitX - 20, 1, 0xFF555555);
        y += 6;
    }
    
    // 2. Draw Scrolling FSK Log
    BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
    int availableHeight = endY - y;
    int scrollLinesToShow = availableHeight / lineHeight;
    if (scrollLinesToShow > 11) scrollLinesToShow = 11; // Safety limit
    
    int linesToShow = (logicalLineCount > scrollLinesToShow) ? scrollLinesToShow : logicalLineCount;
    int startLineIdx = logicalLineCount - linesToShow;
    
