ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    for (int l = 0; l < linesToShow; l++) {
        int charStart = logicalLineStarts[startLineIdx + l];
        int charEnd = (startLineIdx + l + 1 < logicalLineCount) ? logicalLineStarts[startLineIdx + l + 1] : textLen;
        int len = charEnd - charStart;
        if (len <= 0) continue;
        
        char lineBuf[64];
        if (len > 60) len = 60;
        memcpy(lineBuf, &textSnap[charStart], len);
        lineBuf[len] = '\0';
        
        // Clean line endings
        for(int k=0; k<len; k++) if(lineBuf[k] == '\r' || lineBuf[k] == '\n') lineBuf[k] = '\0';

        if (lineBuf[0] != '\0') {
            BSP_LCD_DisplayStringAt(10, y, (uint8_t*)lineBuf, LEFT_MODE);
        }
        y += lineHeight;
    }

    // --- Right Side: TapeStats ---
    // BSP_LCD_SetFont(&Font12); // Already set above
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    y = startY;
    int statsX = splitX + 10;
    char sBuf[64];
    
    int snrInt = (int)g_Modem.lastSNR;
    int snrDec = (int)((g_Modem.lastSNR - snrInt) * 100);
    if(snrDec < 0) snrDec = -snrDec;
    
    // Speed Offset Calculation
    float speedOffset = 0;
    if (g_Modem.lastMeasuredBaud > 0) {
        speedOffset = (g_Modem.lastMeasuredBaud - g_BaudRate) * 100.0f / g_BaudRate;
    }
    int offInt = (int)speedOffset;
    int offDec = (int)((speedOffset - offInt) * 10);
    if(offDec < 0) offDec = -offDec;
    if(offInt < 0) offInt = -offInt; // Fix: Remove embedded minus sign for snprintf
    char sign = (speedOffset >= 0) ? '+' : '-';

    snprintf(sBuf, sizeof(sBuf), "Baud: %d (%c%d.%d%%) | SNR: %d.%02d", 
             (int)g_Modem.lastMeasuredBaud, sign, (int)offInt, (int)offDec, (int)snrInt, (int)snrDec);
    BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight;

    snprintf(sBuf, sizeof(sBuf), "Side: %c | Stops: %d", g_TapeStats.currentSide, g_TapeStats.totalStops);
    BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight;

    snprintf(sBuf, sizeof(sBuf), "Mode: %s", g_TapeStats.isDctMode ? "DCT" : "Generic");
    BSP_LCD_SetTextColor(g_TapeStats.isDctMode ? LCD_COLOR_CYAN : LCD_COLOR_MAGENTA);
    BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight + 4;

    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    int h = g_TapeStats.lastTotalTime / 3600;
    int m = (g_TapeStats.lastTotalTime % 3600) / 60;
    int s = g_TapeStats.lastTotalTime % 60;
    snprintf(sBuf, sizeof(sBuf), "Total: %d (%02d:%02d:%02d)", g_TapeStats.logLineCount, h, m, s);
    BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight;
    
    snprintf(sBuf, sizeof(sBuf), "Errors: %d", g_TapeStats.dataErrors);
    BSP_LCD_SetTextColor(g_TapeStats.dataErrors > 0 ? LCD_COLOR_RED : LCD_COLOR_GREEN);
    BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight + 4;
    
    BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
    float sideAPerc = (g_TapeStats.sideALineCount > 0) ? ((float)g_TapeStats.sideAErrors * 100.0f / (float)g_TapeStats.sideALineCount) : 0.0f;
    int saInt = (int)sideAPerc; int saDec = (int)((sideAPerc - saInt) * 100); if(saDec < 0) saDec = -saDec;
    snprintf(sBuf, sizeof(sBuf), "Side A: %d/%d (%d.%02d%%)", g_TapeStats.sideAErrors, g_TapeStats.sideALineCount, saInt, saDec);
    BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight;

    float sideBPerc = (g_TapeStats.sideBLineCount > 0) ? ((float)g_TapeStats.sideBErrors * 100.0f / (float)g_TapeStats.sideBLineCount) : 0.0f;
    int sbInt = (int)sideBPerc; int sbDec = (int)((sideBPerc - sbInt) * 100); if(sbDec < 0) sbDec = -sbDec;
    snprintf(sBuf, sizeof(sBuf), "Side B: %d/%d (%d.%02d%%)", g_TapeStats.sideBErrors, g_TapeStats.sideBLineCount, sbInt, sbDec);
    BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight + 4;

    BSP_LCD_SetTextColor(LCD_COLOR_CYAN);
    snprintf(sBuf, sizeof(sBuf), "Format Err: L=%d N=%d", g_TapeStats.dataLengthErrors, g_TapeStats.dataErrors);
    BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE);
    y += lineHeight;

    // --- Metadata HUD ---
    if (g_HasMetadata) {
        y += 4; 
        BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
        
        char* filename = strrchr(g_CurrentTrack.sourcePath, '/');
        if (!filename) filename = strrchr(g_CurrentTrack.sourcePath, '\\');
        if (filename) filename++; 
        else filename = g_CurrentTrack.sourcePath;

        char displayBuf[160];
        snprintf(displayBuf, sizeof(displayBuf), "FILE: %s", filename);

        int remain = strlen(displayBuf);
        char* ptr = displayBuf;
        while (remain > 0 && y < 272 - lineHeight) {
            char chunk[32];
            int take = (remain > 30) ? 30 : remain;
            strncpy(chunk, ptr, take);
            chunk[take] = '\0';
            BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)chunk, LEFT_MODE);
            
            y += lineHeight;
            ptr += take;
            remain -= take;
            // BSP_LCD_SetTextColor(LCD_COLOR_CYAN); // Removed to keep Orange color
        }
    }
    
    // No more global resume here, it's handled inside the logical blocks
}


static void initButtons() {
    buttonCount = 0; int bY = 230, bW = 58, bG = 8;
    buttons[buttonCount++] = (Button){10, bY, bW, 30, "SPEC", toggleSpectrum, LCD_COLOR_BLUE, &g_ShowSpectrum};
    buttons[buttonCount++] = (Button){10+(bW+bG), bY, bW, 30, "VU", toggleVU, LCD_COLOR_BLUE, &g_ShowVUMeter};
    buttons[buttonCount++] = (Button){10+(bW+bG)*2, bY, bW, 30, vu_gain_texts[vu_gain_idx], cycleVUGain, LCD_COLOR_MAGENTA, &g_GainAlwaysActive};
    buttons[buttonCount++] = (Button){10+(bW+bG)*3, bY, bW, 30, "WFALL", toggleWaterfall, LCD_COLOR_BLUE, &g_ShowWaterfall};
    buttons[buttonCount++] = (Button){10+(bW+bG)*4, bY, bW, 30, "FSK", toggleFSK, LCD_COLOR_YELLOW, &g_ShowFSK};
    buttons[buttonCount++] = (Button){10+(bW+bG)*5, bY, bW, 30, "SIM", toggleSim, LCD_COLOR_BROWN, &g_SimulationMode};
    buttons[buttonCount++] = (Button){10+(bW+bG)*6, bY, bW, 30, "IN:MIC", toggleInput, LCD_COLOR_CYAN, &g_InputLineIn};
}

