ns96/STM32DiscVU/Core/Src/VisualizerApp.c
static void handleTouch() {
    TS_StateTypeDef ts; if(!ts_enabled) return;
    BSP_TS_GetState(&ts);
    if(ts.touchDetected) {
        static uint32_t lastT = 0; if(HAL_GetTick() - lastT < 200) return;
        lastT = HAL_GetTick();
        
        if (ts.touchY[0] >= UI_VIZ_TOP && ts.touchY[0] < UI_VIZ_BOTTOM) {
            int zone = ts.touchX[0] / 160;
            if (zone == 0) { // Left third
                if (g_ShowFSK) {
                    // Clear FSK log and stats
                    vTaskSuspendAll();
                    memset(g_FSKText, 0, sizeof(g_FSKText));
                    g_FSKTextLen = 0;
                    memset(&g_TapeStats, 0, sizeof(g_TapeStats));
                    g_TapeStats.currentSide = 'A';
                    g_CurrentLineIdx = 0;
                    xTaskResumeAll();
                } else if (g_ShowSpectrum) {
                    // Cycle Spectrum Modes: Mono -> Split -> Mono LED -> Split LED
                    g_SpectrumMode = (g_SpectrumMode + 1) % 4;
                }
            } else if (zone == 1) { // Middle third: Toggle Peak Hold
                g_EnablePeakHold = !g_EnablePeakHold;
                if (g_EnablePeakHold) {
                    memset(g_SpectrumPeaks, 0, sizeof(g_SpectrumPeaks));
                    memset(g_VUPeaks, 0, sizeof(g_VUPeaks));
                }
            } else if (zone == 2) { // Right third: Cycle Baud Rate
                if (g_ShowFSK) cycleBaudRate();
            }
            return; // Don't process buttons if we hit a viz zone
        }

        // 2. Check Buttons
        for(int i=0; i<buttonCount; i++) {
            Button* b = &buttons[i];
            if(ts.touchX[0] >= b->x && ts.touchX[0] <= b->x+b->w && ts.touchY[0] >= b->y && ts.touchY[0] <= b->y+b->h) {
                if(b->onClick) b->onClick(); 
                break;
            }
        }
    }
}

static void toggleWaterfall() { g_ShowWaterfall = !g_ShowWaterfall; if(g_ShowWaterfall) { g_ShowSpectrum = false; g_ShowFSK = false; } }
static void toggleSpectrum() { g_ShowSpectrum = !g_ShowSpectrum; if(g_ShowSpectrum) { g_ShowWaterfall = false; g_ShowFSK = false; } }
static void toggleVU() { g_ShowVUMeter = !g_ShowVUMeter; }
static void toggleSim() { g_SimulationMode = !g_SimulationMode; fftIdx = 0; }

static void toggleFSK() {
    g_ShowFSK = !g_ShowFSK;
    if (g_ShowFSK) {
        g_ShowWaterfall = false;
        g_ShowSpectrum = false;
        // Reset text for fresh start
        memset(g_FSKText, 0, sizeof(g_FSKText));
        g_FSKTextLen = 0;
        memset(&g_TapeStats, 0, sizeof(g_TapeStats));
        g_TapeStats.currentSide = 'A';
        g_CurrentLineIdx = 0;
        // Proportional frequency scaling for shifted audio (Reference: 1200 baud = 1200/2200 Hz)
        float scale = g_BaudRate / 1200.0f;
        g_Modem.cfg.freqMark = 1200.0f * scale;
        g_Modem.cfg.freqSpace = 2200.0f * scale;
        g_Modem.cfg.baudRate = g_BaudRate;
        g_Modem.cfg.sampleRate = 12000.0f;
        g_Modem.cfg.noiseFloor = 0.2f; // Matched to reference (20% signal)
        g_Modem.cfg.invert = false;
        FSK_Init(&g_Modem, g_Modem.cfg);
        
        printf("VisualizerApp: Init sequence complete.\r\n");
    }
}

extern int16_t playback_buffer[AUDIO_BUFFER_SIZE];

static void Visualizer_InitAudio() {
    static bool first_init = true;
    if (!first_init) {
        BSP_AUDIO_IN_Stop(CODEC_PDWN_SW);
        BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
    }
    first_init = false;
    
    // 1. Initialize Output FIRST (Headphones)
    // This ensures the codec reset happens before we configure the microphone/line input
    if (BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_HEADPHONE, 90, SAMPLING_FREQ) == AUDIO_OK) {
        memset(playback_buffer, 0, sizeof(playback_buffer));
        BSP_AUDIO_OUT_Play((uint16_t*)playback_buffer, AUDIO_BUFFER_SIZE);
        printf("[AUDIO] Output Init OK (Passthrough Active)\r\n");
    } else {
        printf("[AUDIO] Output Init FAILED!\r\n");
    }

    // 2. Initialize Input SECOND (Mic/Line)
    uint16_t dev = g_InputLineIn ? INPUT_DEVICE_INPUT_LINE_1 : INPUT_DEVICE_DIGITAL_MICROPHONE_2;
    if(BSP_AUDIO_IN_InitEx(dev, SAMPLING_FREQ, 16, 2) == AUDIO_OK) {
        BSP_AUDIO_IN_Record((uint16_t*)audio_buffer, AUDIO_BUFFER_SIZE);
        // Switch to the appropriate software gain for the new source
        g_AudioGain = g_InputLineIn ? g_LineInGain : g_MicGain;
    } else {
        printf("[AUDIO] Input Init FAILED!\r\n");
    }
}

static void toggleInput() {
    g_InputLineIn = !g_InputLineIn;
    Visualizer_InitAudio();
    buttons[6].text = g_InputLineIn ? "IN:LINE" : "IN:MIC";
}

static void cycleVUGain() {
    vu_gain_idx = (vu_gain_idx + 1) % 5;
    g_VUGain = vu_gain_vals[vu_gain_idx];
    buttons[2].text = vu_gain_texts[vu_gain_idx];
}
static uint32_t Color565ToARGB(uint16_t rgb565) {
    uint32_t r = (rgb565 >> 11) & 0x1F; uint32_t g = (rgb565 >> 5) & 0x3F; uint32_t b = rgb565 & 0x1F;
    return 0xFF000000 | (((r*255)/31) << 16) | (((g*255)/63) << 8) | ((b*255)/31);
}
static void cycleBaudRate(void) {
    g_BaudIdx = (g_BaudIdx + 1) % 5;
    g_BaudRate = g_BaudRates[g_BaudIdx];
    
    // Scale frequencies proportionally to the baud rate (Reference: 1200 baud = 1200/2200 Hz)
    float scale = g_BaudRate / 1200.0f;
    g_Modem.cfg.freqMark = 1200.0f * scale;
    g_Modem.cfg.freqSpace = 2200.0f * scale;
    g_Modem.cfg.baudRate = g_BaudRate;
    g_Modem.cfg.baudCorrection = g_BaudCorrectionFactor;
    FSK_Init(&g_Modem, g_Modem.cfg);
    
    // Clear text area and print new baud
    g_FSKTextLen = 0;
    g_FSKText[0] = '\0';
    
    char msg[32];
    snprintf(msg, sizeof(msg), "[BAUD: %d]\n", (int)g_BaudRate);
    for(int i=0; msg[i]; i++) addFSKChar(msg[i]);
    
    printf("FSK: Switched to %d baud\r\n", (int)g_BaudRate);
}

static void FillRectDMA2D(uint32_t* fb, int x, int y, int w, int h, uint32_t color) {
    if (x < 0) { w += x; x = 0; }
    if (y < 0) { h += y; y = 0; }
    if (x + w > 480) w = 480 - x;
    if (y + h > 272) h = 272 - y;
    if (w <= 0 || h <= 0) return;

    // WAIT for previous operation at the START
    while (hdma2d.Instance->CR & DMA2D_CR_START);

    hdma2d.Instance->OPFCCR = DMA2D_OUTPUT_ARGB8888;
    hdma2d.Instance->OOR = 480 - w;
    hdma2d.Instance->OMAR = (uint32_t)&fb[y * 480 + x];
    hdma2d.Instance->NLR = (w << 16) | h;
    hdma2d.Instance->OCOLR = color;
    
    // Start Register-to-Memory fill
    hdma2d.Instance->CR = DMA2D_R2M | DMA2D_CR_START;
}

static void CopyBlockDMA2D(uint32_t* src, uint32_t* dst, int width, int height) {
    while (hdma2d.Instance->CR & DMA2D_CR_START);
    hdma2d.Instance->CR = DMA2D_M2M;
    hdma2d.Instance->OPFCCR = DMA2D_OUTPUT_ARGB8888;
    hdma2d.Instance->FGPFCCR = DMA2D_INPUT_ARGB8888;
    hdma2d.Instance->FGMAR = (uint32_t)src;
    hdma2d.Instance->OMAR = (uint32_t)dst;
    hdma2d.Instance->FGOR = 0;
    hdma2d.Instance->OOR = 480 - width;
    hdma2d.Instance->NLR = (width << 16) | height;
    hdma2d.Instance->CR |= DMA2D_CR_START;
}
